## Topics:
    1.Read CSV 
    ->further we have to learn separators,delimiter,true_values,false_values   and many more       
    2.Write CSV
    3.Read Excel
    4.Write Excel

## 1. Read CSV
#Dealing With extra header

In [7]:
#skiprows = 1 or
#header = 1

import pandas as pd

df = pd.read_csv("stock.csv",skiprows=1)
df

  ticket            esp  revenue price         people
0  GOOGL          27.82       87   845     larry page
1    WMT           4.61      484    65           n.a.
2   MSFT             -1       85    64     bill gates
3    RIL  not available       50  1023  mukesh ambani
4   TATA            5.6       -1  n.a.     ratan tata

#Without any header

In [10]:
#header = None
#provides 'names' arguments

import pandas as pd

dataframe = pd.read_csv("stock.csv",header=None , names=['ticket','esp','revenue','price','people'])
dataframe

  ticket            esp  revenue price         people
0  GOOGL          27.82       87   845     larry page
1    WMT           4.61      484    65           n.a.
2   MSFT             -1       85    64     bill gates
3    RIL  not available       50  1023  mukesh ambani
4   TATA            5.6       -1  n.a.     ratan tata

#read only specific rows

In [12]:
dataframe = pd.read_csv("stock.csv",nrows=3)
dataframe

  ticket    esp  revenue  price      people
0  GOOGL  27.82       87    845  larry page
1    WMT   4.61      484     65        n.a.
2   MSFT  -1.00       85     64  bill gates

###### handle uncommon types of value -> n.a. or not available

In [20]:
dataframe = pd.read_csv("stock.csv", na_values=['not available','n.a.'])
dataframe

  ticket    esp  revenue   price         people
0  GOOGL  27.82       87   845.0     larry page
1    WMT   4.61      484    65.0            NaN
2   MSFT  -1.00       85    64.0     bill gates
3    RIL    NaN       50  1023.0  mukesh ambani
4   TATA   5.60       -1     NaN     ratan tata

###### Supply dictionary to replace NaN values

In [22]:
# na_values helps to cleaing up massive data

dataframe = pd.read_csv("stock.csv", na_values={
    'esp': ['not available','n.a.'],
    'revenue': ['not available','n.a.',-1],
     'price': ['not available','n.a.'],
    'people': ['not available','n.a.']
})
dataframe

  ticket    esp  revenue   price         people
0  GOOGL  27.82     87.0   845.0     larry page
1    WMT   4.61    484.0    65.0            NaN
2   MSFT  -1.00     85.0    64.0     bill gates
3    RIL    NaN     50.0  1023.0  mukesh ambani
4   TATA   5.60      NaN     NaN     ratan tata

## 2. Write CSV

In [29]:
#to remove index values.... write->index = false
#to write only specific columns...write->columns=['columns_name']
#to skip header... write->header = False

dataframe.to_csv("new_stock.csv",index = False,columns=['ticket','esp'])

# 3.Read Excel

In [39]:
import pandas as pd

excel = pd.read_excel("stock_data.xlsx","Sheet1")
excel

  ticket            esp  revenue price         people
0  GOOGL          27.82       87   845     larry page
1    WMT           4.61      484    65           n.a.
2   MSFT             -1       85    64     bill gates
3    RIL  not available       50  1023  mukesh ambani
4   TATA            5.6       -1  n.a.     ratan tata

###### converts and argument in excel
converter argument basically takes python dictionary

In [41]:
def convert_people_Cell(cell):
    if cell=='n.a.':
        return 'sam walton'
    return cell

def convert_esp_Cell(cell):
    if cell=='not available':
        return None
    return cell


excel = pd.read_excel("stock_data.xlsx","Sheet1", converters={  
    'people':convert_people_Cell,
    'esp':convert_esp_Cell
})
excel

  ticket    esp  revenue price         people
0  GOOGL  27.82       87   845     larry page
1    WMT   4.61      484    65     sam walton
2   MSFT  -1.00       85    64     bill gates
3    RIL    NaN       50  1023  mukesh ambani
4   TATA   5.60       -1  n.a.     ratan tata

## 4.Write Excel

In [43]:
excel.to_excel("new_stock.xlsx",sheet_name="stocks", index=False,startrow=2,startcol=2)

###### write two dataframes into one single excel file in 2 different excel sheet

In [44]:
df_stocks = pd.DataFrame({
    'ticket':['GOOGL','WMT','MSFT'],
    'price':[845,65,64]
})

df_weather = pd.DataFrame({
    'day':['1/1/2017','2/1/2017','3/1/2017'],
    'event':['Rain','Sunny','Snow']
})

In [46]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")